//位运算符作用于位与(&)或(|)非(^)取反(~)
//<< 左移运算符，将二进制位全部左移若干位，左边丢弃，右边补0
//>> 右移运算符
#include <stdio.h>
int main()
{
    int a = 60;//0011 1100
    int b = 13;//0000 1101
    int c = 0;

    c = a & b;//与运算，0000 1100
    printf("A:  c = %d\n",c);
    c = a | b;//或运算, 0011 1101
    printf("B:  c = %d\n",c);
    c = a ^ b;//非运算, 00110001
    printf("C:  c = %d\n",c);
    c = ~a;//取反运算，1100 0011
    printf("D:  c = %d\n",c);
    c = a << 2;//左移运算，1111 0000
    printf("E:  c = %d\n",c);
    c = a >> 3;//右移运算, 0000 0111
    printf("F:  c = %d\n",c);
}